apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_dma_v1_7ch.h
/* ADC */

#  define DMACHAN_ADC1_1          DMACHAN_SETTING(STM32_DMA1_CHAN1, 0)
#  define DMACHAN_ADC1_2          DMACHAN_SETTING(STM32_DMA2_CHAN3, 0)

#  define DMACHAN_ADC2_1          DMACHAN_SETTING(STM32_DMA1_CHAN1, 0)
#  define DMACHAN_ADC2_2          DMACHAN_SETTING(STM32_DMA2_CHAN4, 0)

#  define DMACHAN_ADC3_1          DMACHAN_SETTING(STM32_DMA1_CHAN1, 0)
#  define DMACHAN_ADC3_2          DMACHAN_SETTING(STM32_DMA2_CHAN5, 0)

/* AES */

#  define DMACHAN_AES_IN_1        DMACHAN_SETTING(STM32_DMA2_CHAN1, 6)
#  define DMACHAN_AES_IN_2        DMACHAN_SETTING(STM32_DMA2_CHAN5, 6)
#  define DMACHAN_AES_OUT_1       DMACHAN_SETTING(STM32_DMA2_CHAN2, 6)
#  define DMACHAN_AES_OUT_2       DMACHAN_SETTING(STM32_DMA2_CHAN3, 6)

/* DAC */

#  define DMACHAN_DAC1_1          DMACHAN_SETTING(STM32_DMA1_CHAN3, 6)
#  define DMACHAN_DAC1_2          DMACHAN_SETTING(STM32_DMA1_CHAN4, 5)
#  define DMACHAN_DAC1_3          DMACHAN_SETTING(STM32_DMA2_CHAN4, 3)

#  define DMACHAN_DAC2            DMACHAN_SETTING(STM32_DMA2_CHAN5, 3)

/* I2C */

#  define DMACHAN_I2C1_RX_1       DMACHAN_SETTING(STM32_DMA1_CHAN7, 3)
#  define DMACHAN_I2C1_RX_2       DMACHAN_SETTING(STM32_DMA2_CHAN6, 5)
#  define DMACHAN_I2C1_TX_1       DMACHAN_SETTING(STM32_DMA1_CHAN6, 3)
#  define DMACHAN_I2C1_TX_2       DMACHAN_SETTING(STM32_DMA2_CHAN7, 5)

#  define DMACHAN_I2C2_RX         DMACHAN_SETTING(STM32_DMA1_CHAN5, 3)
#  define DMACHAN_I2C2_TX         DMACHAN_SETTING(STM32_DMA1_CHAN4, 3)

#  define DMACHAN_I2C3_RX         DMACHAN_SETTING(STM32_DMA1_CHAN3, 2)
#  define DMACHAN_I2C3_TX         DMACHAN_SETTING(STM32_DMA1_CHAN2, 3)

/* QUADSPI */

#  define DMACHAN_QUADSPI_1       DMACHAN_SETTING(STM32_DMA1_CHAN5, 5)
#  define DMACHAN_QUADSPI_2       DMACHAN_SETTING(STM32_DMA2_CHAN7, 3)

/* SPI */

#  define DMACHAN_SPI1_RX_1       DMACHAN_SETTING(STM32_DMA1_CHAN2, 1)
#  define DMACHAN_SPI1_RX_2       DMACHAN_SETTING(STM32_DMA2_CHAN3, 4)
#  define DMACHAN_SPI1_TX_1       DMACHAN_SETTING(STM32_DMA1_CHAN3, 0)
#  define DMACHAN_SPI1_TX_2       DMACHAN_SETTING(STM32_DMA2_CHAN4, 4)

#  define DMACHAN_SPI2_RX         DMACHAN_SETTING(STM32_DMA1_CHAN4, 1)
#  define DMACHAN_SPI2_TX         DMACHAN_SETTING(STM32_DMA1_CHAN5, 1)

#  define DMACHAN_SPI3_RX         DMACHAN_SETTING(STM32_DMA2_CHAN1, 3)
#  define DMACHAN_SPI3_TX         DMACHAN_SETTING(STM32_DMA2_CHAN2, 3)

/* TIM */

#  define DMACHAN_TIM1_CH1        DMACHAN_SETTING(STM32_DMA1_CHAN2, 7)
#  define DMACHAN_TIM1_CH2        DMACHAN_SETTING(STM32_DMA1_CHAN3, 7)
#  define DMACHAN_TIM1_CH3        DMACHAN_SETTING(STM32_DMA1_CHAN7, 7)
#  define DMACHAN_TIM1_CH4        DMACHAN_SETTING(STM32_DMA1_CHAN4, 7)
#  define DMACHAN_TIM1_COM        DMACHAN_SETTING(STM32_DMA1_CHAN4, 7)
#  define DMACHAN_TIM1_TRIG       DMACHAN_SETTING(STM32_DMA1_CHAN4, 7)
#  define DMACHAN_TIM1_UP         DMACHAN_SETTING(STM32_DMA1_CHAN6, 7)

#  define DMACHAN_TIM2_CH1        DMACHAN_SETTING(STM32_DMA1_CHAN5, 4)
#  define DMACHAN_TIM2_CH2        DMACHAN_SETTING(STM32_DMA1_CHAN7, 4)
#  define DMACHAN_TIM2_CH3        DMACHAN_SETTING(STM32_DMA1_CHAN1, 4)
#  define DMACHAN_TIM2_CH4        DMACHAN_SETTING(STM32_DMA1_CHAN7, 4)
#  define DMACHAN_TIM2_UP         DMACHAN_SETTING(STM32_DMA1_CHAN2, 4)

#  define DMACHAN_TIM3_CH1        DMACHAN_SETTING(STM32_DMA1_CHAN6, 5)
#  define DMACHAN_TIM3_CH3        DMACHAN_SETTING(STM32_DMA1_CHAN2, 5)
#  define DMACHAN_TIM3_CH4        DMACHAN_SETTING(STM32_DMA1_CHAN3, 5)
#  define DMACHAN_TIM3_TRIG       DMACHAN_SETTING(STM32_DMA1_CHAN6, 5)
#  define DMACHAN_TIM3_UP         DMACHAN_SETTING(STM32_DMA1_CHAN3, 5)

#  define DMACHAN_TIM4_CH1        DMACHAN_SETTING(STM32_DMA1_CHAN1, 6)
#  define DMACHAN_TIM4_CH2        DMACHAN_SETTING(STM32_DMA1_CHAN4, 6)
#  define DMACHAN_TIM4_CH3        DMACHAN_SETTING(STM32_DMA1_CHAN5, 6)
#  define DMACHAN_TIM4_UP         DMACHAN_SETTING(STM32_DMA1_CHAN7, 6)

#  define DMACHAN_TIM5_CH1        DMACHAN_SETTING(STM32_DMA2_CHAN5, 5)
#  define DMACHAN_TIM5_CH2        DMACHAN_SETTING(STM32_DMA2_CHAN4, 5)
#  define DMACHAN_TIM5_CH3        DMACHAN_SETTING(STM32_DMA2_CHAN2, 5)
#  define DMACHAN_TIM5_CH4        DMACHAN_SETTING(STM32_DMA2_CHAN1, 5)
#  define DMACHAN_TIM5_COM        DMACHAN_SETTING(STM32_DMA2_CHAN1, 5)
#  define DMACHAN_TIM5_TRIG       DMACHAN_SETTING(STM32_DMA2_CHAN1, 5)
#  define DMACHAN_TIM5_UP         DMACHAN_SETTING(STM32_DMA2_CHAN2, 5)

#  define DMACHAN_TIM6_UP_1       DMACHAN_SETTING(STM32_DMA1_CHAN3, 6)
#  define DMACHAN_TIM6_UP_2       DMACHAN_SETTING(STM32_DMA2_CHAN4, 3)

#  define DMACHAN_TIM7_UP_1       DMACHAN_SETTING(STM32_DMA1_CHAN4, 5)
#  define DMACHAN_TIM7_UP_2       DMACHAN_SETTING(STM32_DMA2_CHAN5, 3)

#  define DMACHAN_TIM8_CH1        DMACHAN_SETTING(STM32_DMA2_CHAN6, 7)
#  define DMACHAN_TIM8_CH2        DMACHAN_SETTING(STM32_DMA2_CHAN7, 7)
#  define DMACHAN_TIM8_CH3        DMACHAN_SETTING(STM32_DMA2_CHAN1, 7)
#  define DMACHAN_TIM8_CH4        DMACHAN_SETTING(STM32_DMA2_CHAN2, 7)
#  define DMACHAN_TIM8_COM        DMACHAN_SETTING(STM32_DMA2_CHAN2, 7)
#  define DMACHAN_TIM8_TRIG       DMACHAN_SETTING(STM32_DMA2_CHAN2, 7)
#  define DMACHAN_TIM8_UP         DMACHAN_SETTING(STM32_DMA2_CHAN1, 7)

#  define DMACHAN_TIM15_CH1       DMACHAN_SETTING(STM32_DMA1_CHAN5, 7)
#  define DMACHAN_TIM15_COM       DMACHAN_SETTING(STM32_DMA1_CHAN5, 7)
#  define DMACHAN_TIM15_TRIG      DMACHAN_SETTING(STM32_DMA1_CHAN5, 7)
#  define DMACHAN_TIM15_UP        DMACHAN_SETTING(STM32_DMA1_CHAN5, 7)

#  define DMACHAN_TIM16_CH1_1     DMACHAN_SETTING(STM32_DMA1_CHAN3, 4)
#  define DMACHAN_TIM16_CH1_2     DMACHAN_SETTING(STM32_DMA1_CHAN6, 4)
#  define DMACHAN_TIM16_UP_1      DMACHAN_SETTING(STM32_DMA1_CHAN3, 4)
#  define DMACHAN_TIM16_UP_2      DMACHAN_SETTING(STM32_DMA1_CHAN6, 4)

#  define DMACHAN_TIM17_CH1_1     DMACHAN_SETTING(STM32_DMA1_CHAN1, 5)
#  define DMACHAN_TIM17_CH1_2     DMACHAN_SETTING(STM32_DMA1_CHAN7, 5)
#  define DMACHAN_TIM17_UP_1      DMACHAN_SETTING(STM32_DMA1_CHAN1, 5)
#  define DMACHAN_TIM17_UP_2      DMACHAN_SETTING(STM32_DMA1_CHAN7, 5)

/* USARTs */

#  define DMACHAN_USART1_RX_1     DMACHAN_SETTING(STM32_DMA1_CHAN5, 2)
#  define DMACHAN_USART1_RX_2     DMACHAN_SETTING(STM32_DMA2_CHAN7, 2)
#  define DMACHAN_USART1_TX_1     DMACHAN_SETTING(STM32_DMA1_CHAN4, 2)
#  define DMACHAN_USART1_TX_2     DMACHAN_SETTING(STM32_DMA2_CHAN6, 2)

#  define DMACHAN_USART2_RX       DMACHAN_SETTING(STM32_DMA1_CHAN6, 2)
#  define DMACHAN_USART2_TX       DMACHAN_SETTING(STM32_DMA1_CHAN7, 2)

#  define DMACHAN_USART3_RX       DMACHAN_SETTING(STM32_DMA1_CHAN3, 1)
#  define DMACHAN_USART3_TX       DMACHAN_SETTING(STM32_DMA1_CHAN2, 2)

#  define DMACHAN_USART4_RX       DMACHAN_SETTING(STM32_DMA2_CHAN5, 2)
#  define DMACHAN_USART4_TX       DMACHAN_SETTING(STM32_DMA2_CHAN3, 2)

