apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_dma_v1_7ch.h
#  define DMACHAN_USART5_RX       DMACHAN_SETTING(STM32_DMA2_CHAN2, 2)
#  define DMACHAN_USART5_TX       DMACHAN_SETTING(STM32_DMA2_CHAN1, 2)

#elif defined(CONFIG_ARCH_CHIP_STM32L0)

/* ADC */

#  define DMACHAN_ADC1_1          DMACHAN_SETTING(STM32_DMA1_CHAN1, 0)
#  define DMACHAN_ADC1_2          DMACHAN_SETTING(STM32_DMA1_CHAN2, 0)

/* AES */

#  define DMACHAN_AES_IN_1        DMACHAN_SETTING(STM32_DMA1_CHAN1, 11)
#  define DMACHAN_AES_IN_2        DMACHAN_SETTING(STM32_DMA1_CHAN5, 11)
#  define DMACHAN_AES_OUT_1       DMACHAN_SETTING(STM32_DMA1_CHAN2, 11)
#  define DMACHAN_AES_OUT_2       DMACHAN_SETTING(STM32_DMA1_CHAN3, 11)

/* DAC */

#  define DMACHAN_DAC1CH1         DMACHAN_SETTING(STM32_DMA1_CHAN2, 9)
#  define DMACHAN_DAC1CH2         DMACHAN_SETTING(STM32_DMA1_CHAN4, 15)

/* I2C */

#  define DMACHAN_I2C1_TX_1       DMACHAN_SETTING(STM32_DMA1_CHAN2, 6)
#  define DMACHAN_I2C1_TX_2       DMACHAN_SETTING(STM32_DMA1_CHAN6, 6)
#  define DMACHAN_I2C1_RX_1       DMACHAN_SETTING(STM32_DMA1_CHAN3, 6)
#  define DMACHAN_I2C1_RX_2       DMACHAN_SETTING(STM32_DMA1_CHAN7, 6)
#  define DMACHAN_I2C2_TX         DMACHAN_SETTING(STM32_DMA1_CHAN4, 7)
#  define DMACHAN_I2C2_RX         DMACHAN_SETTING(STM32_DMA1_CHAN7, 7)
#  define DMACHAN_I2C3_TX_1       DMACHAN_SETTING(STM32_DMA1_CHAN2, 14)
#  define DMACHAN_I2C3_TX_2       DMACHAN_SETTING(STM32_DMA1_CHAN4, 14)
#  define DMACHAN_I2C3_RX_1       DMACHAN_SETTING(STM32_DMA1_CHAN3, 14)
#  define DMACHAN_I2C3_RX_2       DMACHAN_SETTING(STM32_DMA1_CHAN5, 14)

/* SPI */

#  define DMACHAN_SPI1_RX         DMACHAN_SETTING(STM32_DMA1_CHAN2, 1)
#  define DMACHAN_SPI1_TX         DMACHAN_SETTING(STM32_DMA1_CHAN3, 1)
#  define DMACHAN_SPI2_RX_1       DMACHAN_SETTING(STM32_DMA1_CHAN4, 2)
#  define DMACHAN_SPI2_RX_2       DMACHAN_SETTING(STM32_DMA1_CHAN6, 2)
#  define DMACHAN_SPI2_TX_1       DMACHAN_SETTING(STM32_DMA1_CHAN5, 2)
#  define DMACHAN_SPI2_TX_2       DMACHAN_SETTING(STM32_DMA1_CHAN7, 2)

/* TIM */

#  define DMACHAN_TIM2_CH1        DMACHAN_SETTING(STM32_DMA1_CHAN5, 8)
#  define DMACHAN_TIM2_CH2_1      DMACHAN_SETTING(STM32_DMA1_CHAN3, 8)
#  define DMACHAN_TIM2_CH2_2      DMACHAN_SETTING(STM32_DMA1_CHAN7, 8)
#  define DMACHAN_TIM2_CH3        DMACHAN_SETTING(STM32_DMA1_CHAN1, 8)
#  define DMACHAN_TIM2_CH4_1      DMACHAN_SETTING(STM32_DMA1_CHAN4, 8)
#  define DMACHAN_TIM2_CH4_2      DMACHAN_SETTING(STM32_DMA1_CHAN7, 8)
#  define DMACHAN_TIM2_UP         DMACHAN_SETTING(STM32_DMA1_CHAN2, 8)
#  define DMACHAN_TIM6_UP         DMACHAN_SETTING(STM32_DMA1_CHAN2, 9)
#  define DMACHAN_TIM7_UP         DMACHAN_SETTING(STM32_DMA1_CHAN4, 15)

/* USART */

#  define DMACHAN_USART1_TX_1     DMACHAN_SETTING(STM32_DMA1_CHAN2, 3)
#  define DMACHAN_USART1_TX_2     DMACHAN_SETTING(STM32_DMA1_CHAN4, 3)
#  define DMACHAN_USART1_RX_1     DMACHAN_SETTING(STM32_DMA1_CHAN3, 3)
#  define DMACHAN_USART1_RX_2     DMACHAN_SETTING(STM32_DMA1_CHAN5, 3)
#  define DMACHAN_USART2_TX_1     DMACHAN_SETTING(STM32_DMA1_CHAN4, 4)
#  define DMACHAN_USART2_TX_2     DMACHAN_SETTING(STM32_DMA1_CHAN7, 4)
#  define DMACHAN_USART2_RX_1     DMACHAN_SETTING(STM32_DMA1_CHAN5, 4)
#  define DMACHAN_USART2_RX_2     DMACHAN_SETTING(STM32_DMA1_CHAN6, 4)
#  define DMACHAN_LPUART1_TX_1    DMACHAN_SETTING(STM32_DMA1_CHAN2, 5)
#  define DMACHAN_LPUART1_TX_2    DMACHAN_SETTING(STM32_DMA1_CHAN7, 5)
#  define DMACHAN_LPUART1_RX_1    DMACHAN_SETTING(STM32_DMA1_CHAN3, 5)
#  define DMACHAN_LPUART1_RX_2    DMACHAN_SETTING(STM32_DMA1_CHAN6, 5)
#  define DMACHAN_USART4_RX_1     DMACHAN_SETTING(STM32_DMA1_CHAN2, 12)
#  define DMACHAN_USART4_RX_2     DMACHAN_SETTING(STM32_DMA1_CHAN6, 12)
#  define DMACHAN_USART4_TX_1     DMACHAN_SETTING(STM32_DMA1_CHAN7, 12)
#  define DMACHAN_USART4_TX_2     DMACHAN_SETTING(STM32_DMA1_CHAN3, 12)
#  define DMACHAN_USART5_RX_1     DMACHAN_SETTING(STM32_DMA1_CHAN2, 13)
#  define DMACHAN_USART5_RX_2     DMACHAN_SETTING(STM32_DMA1_CHAN6, 13)
#  define DMACHAN_USART5_TX_1     DMACHAN_SETTING(STM32_DMA1_CHAN7, 13)
#  define DMACHAN_USART5_TX_2     DMACHAN_SETTING(STM32_DMA1_CHAN3, 13)

#elif defined(CONFIG_ARCH_CHIP_STM32G0) || defined(CONFIG_ARCH_CHIP_STM32C0) || \
      defined(CONFIG_ARCH_CHIP_STM32U0)
/* This family uses a DMAMUX */

#else
#  error "Unknown DMA channel assignments"
#endif

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_DMA_V1_7CH_H */
